{
    "version": "https://jsonfeed.org/version/1",
    "title": "Opheleo",
    "description": "",
    "home_page_url": "https://opheleo.cf",
    "feed_url": "https://opheleo.cf/feed.json",
    "user_comment": "",
    "icon": "https://opheleo.cf/media/website/Opheleo_120.png",
    "author": {
        "name": "Iraxel"
    },
    "items": [
        {
            "id": "https://opheleo.cf/death-and-life-two-sides-of-the-same-coin/",
            "url": "https://opheleo.cf/death-and-life-two-sides-of-the-same-coin/",
            "title": "Death and Life, Two Sides of the Same Coin",
            "summary": "Today, people across the world are locked down by dread of a virus that they cannot seen easily. What can be seen however are the frightening graphs of infections and deaths, and the sobering projections of swathes of many more people, countless more, who could die, and die tragically. At a time like this, amidst the fear and gloom for loved ones and self alike, for the economic future, and for the many other uncertainties that lie ahead, one's thoughts turn to a subject that is normally not top of mind. Rising from beneath the covers to which it is&hellip;",
            "content_html": "<p>Today, people across the world are locked down by dread of a virus that they cannot seen easily. What can be seen however are the frightening graphs of infections and deaths, and the sobering projections of swathes of many more people, countless more, who could die, and die tragically. At a time like this, amidst the fear and gloom for loved ones and self alike, for the economic future, and for the many other uncertainties that lie ahead, one's thoughts turn to a subject that is normally not top of mind.</p>\n<h2 id=\"mcetoc_1e6m75net1\"><strong>The specter of mortality</strong></h2>\n<p> Rising from beneath the covers to which it is normally subjected to, the idea of mortality wakes up and walks across one's consciousness. No longer is it shushed and shooed away by the busyness of a usually busy life. It stands around like an uninvited guest not knowing what to do with itself. Yet it cannot leave. The doors are closed.</p>\n<p> Mortality. An idea whose time is now. Many who had planned their careers, travel plans, education, or comfortable retirement have felt the icy fingers of death reminding them of that word. Many are no longer around to consider its implications for life on the planet, but many have recovered and cannot forget their close encounter. And like them, for the vast majority of humanity that hasn't had a close call yet, this is a clarion call to remind themselves of that word. Because, even though the pandemic may pass away sooner or later, that word remains standing around with its timeless truth - everyone dies. One way or another.</p>\n<p> So how is one to make sense of one's mortality? Is one to morbidly mope around waiting for the inevitable? Or must one climb the mountains and meditate for an escape route because really who wants to die? Is there an escape route? If yes, where can it be found?</p>\n<h2 id=\"mcetoc_1e6m75vme2\"> <strong>Comfortless answers</strong></h2>\n<p> What is being taught in schools and colleges across the world is the so-called science of evolution. We are being told that we evolved from lower life forms and that as a race we continue to evolve. The answers of that logic, to the questions posed by this pandemic, is that individuals do not matter. Hundreds of thousands may die but the race will live on. A vaccine will be found. Herd immunity will develop. This will be wiped out. Those left behind can let out a sigh of relief. For now.</p>\n<p> But somehow, those words ring hollow of comfort. If evolution is all there is, what then of individual purpose and meaning? Is this all we scrounge around on the surface of the earth for, as contributors to the progress of the race? Why not live like beasts then for tomorrow we die - surely there must be more!</p>\n<h2 id=\"mcetoc_1e6m76c1a3\"><strong>God. Eternity.</strong></h2>\n<p>So, then we turn to faith and God and eternity. Most do in times of turmoil. Because we eventually discover a buried concept within us that is but the other side of mortality. If mortality means death, then immortality must mean life forever. But can both coexist when all we see is the certainty of death heading towards us like an onrushing wave? Surely, they can. That is if we have eternal spirits, and mortality is merely a transition to a higher state of consciousness. A consciousness that encompasses beings and powers that we are not normally aware of. And so, like many others who have pursued this train of thought, our thoughts turn to gods and our conceptions of them. For if they exist how can we know them? Do we need to know them? If the spiritual plane of consciousness is a reality, why are we so afraid? Is a spiritual reality worse than the world we have known or is it an endless experience of endless delights?</p>\n<h2 id=\"mcetoc_1e6m76p0b4\"> <strong>Seeking life not death</strong></h2>\n<p> The answers to these questions will determine our state of mind as we go through this pandemic. Many have sought these answers but no can claim to have definitively found them. But many have found the solace of faith. Faith comes in different hues, different shapes. But faith comforts as long as it can explain. A child believes it can fly until it falls with a crash when it leaps off a bed. And so, like children, we keep growing in our awareness, shedding our childish beliefs as they fail to prove or explain the realities of our life experiences. We discover laws like gravity, and when we understand the inevitability of those laws, we use them and learn how to really fly. Not in painful ignorance and the inevitable crash, but through understanding and cooperating with those laws we even reach other planets.</p>\n<p> And so, even as we go through that process, we realize that this is what life is. A discovery of physical, and then as we grow older and wiser, the metaphysical. We examine the various concepts that spirituality has to offer. Some say this, some say that, but even as a snake sheds its skin, we shed our incorrect conceptions and move into realities and truths that endure. And once having discovered truths that sustain, we continue on to deeper truths. Thus, many claim their faith protects them from plagues and sicknesses, but then from the hospital bed they realize the higher ideas that faith can in the end only save them from diseases of the soul. And so, all of life is about realizing that mortality cannot be cheated. Death is the price to be paid for life. And may God speed us all as we go about discovering these eternal truths. </p>",
            "image": "https://opheleo.cf/media/posts/7/man-in-black-jacket-standing-in-front-of-grave-3648309.jpg",
            "author": {
                "name": "Iraxel"
            },
            "tags": [
                   "Articles"
            ],
            "date_published": "2020-04-24T19:20:39+05:30",
            "date_modified": "2020-04-24T19:21:55+05:30"
        },
        {
            "id": "https://opheleo.cf/contact/",
            "url": "https://opheleo.cf/contact/",
            "title": "Contact",
            "summary": "If you would, please fill out the form below. Loading…",
            "content_html": "<p>If you would, please fill out the form below.</p>\n<p><iframe width=\"640\" height=\"673\" src=\"https://docs.google.com/forms/d/e/1FAIpQLSfI3nNN45mirmA7McRtJmovPKi7Vq8De_XYS9R4Ps9IzNR36g/viewform?embedded=true\" frameborder=\"0\" marginheight=\"0\" marginwidth=\"0\">Loading…</iframe></p>",
            "author": {
                "name": "Iraxel"
            },
            "tags": [
            ],
            "date_published": "2020-04-19T19:44:03+05:30",
            "date_modified": "2020-04-19T21:13:42+05:30"
        },
        {
            "id": "https://opheleo.cf/whats-common-between-greed-and-immorality/",
            "url": "https://opheleo.cf/whats-common-between-greed-and-immorality/",
            "title": "Whats Common Between Greed and Immorality?",
            "summary": "In the epistle to the Colossians, Paul exhorts the believers of that church to consider the members of their earthly bodies as dead to various things: “Consider the members of your earthly body as dead to immorality, impurity, passion, evil desire, and greed, which amounts to idolatry.” - Col 3:5b (NASB) As I read this verse, I was surprised to find greed a part of this list. It was almost like finding an orange in a box of apples. The word greed is the only one that seemingly does not have much to do with sexuality. So, curious, I looked up the&hellip;",
            "content_html": "<p class=\"p1\"><span class=\"s1\">In the epistle to the Colossians, Paul exhorts the believers of that church to consider the members of their earthly bodies as dead to various things: <i>“Consider the members of your earthly body as dead to immorality, impurity, passion, evil desire, and greed, which amounts to idolatry.”</i> - Col 3:5b (NASB)</span></p>\n<p class=\"p2\">As I read this verse, I was surprised to find greed a part of this list. It was almost like finding an orange in a box of apples. The word greed is the only one that seemingly does not have much to do with sexuality. So, curious, I looked up the Greek words used in the original text and their meanings:</p>\n<ul class=\"ul1\">\n<li class=\"li1\"><span class=\"s1\">Immorality (Greek: porneia) - illicit sexual intercourse</span></li>\n<li class=\"li1\"><span class=\"s1\">Impurity (Greek: akatharsia) - the impurity of lustful, luxurious, profligate living</span></li>\n<li class=\"li1\"><span class=\"s1\">Passion (Greek: pathos) - used in the NT in a bad sense i.e depraved passion</span></li>\n<li class=\"li1\"><span class=\"s1\">Desire (Greek: epithymia) - used in the NT desire for what is forbidden, lust</span></li>\n</ul>\n<p class=\"p2\">Wherever these words have been used in the new testament (NT), they always refer to some kind of sexual deviancy either in thought or deed. And so the Colossians list is that of sexual sinfulness descending in order of severity.</p>\n<p class=\"p2\">This verse reminded me of another portion in James 1:14,15: <i>“But each one is tempted when he is carried away and enticed by his own lust (epithymia). Then when lust has conceived, it gives birth to sin; and when sin is accomplished, it brings forth death.”</i> In just a similar vein, the descending severity of the list in Colossians could present before the mind a picture of desire<span class=\"Apple-converted-space\">  </span>conceiving passion, which in turn conceives impurity, which finally conceives immorality. So why then is greed the mother lode of this list when it apparently doesn’t have anything to do with immorality. Or does it?</p>\n<p class=\"p2\">The key is found in the phrase, “greed, which amounts to idolatry” or better translated in the KJV as “which is idolatry.” Paul clearly equates greed with idolatry. And it is this equation with idolatry which perhaps explains why greed is the first rung on this ascending ladder of desire.</p>\n<p class=\"p2\">The link between Idolatry and immorality is most clearly seen in the passage of Romans 1: 21-32). Watch how the idolatry in v23 begins a downward trajectory:</p>\n<p class=\"p1\"><span class=\"s1\">v23 - <i>“...they exchanged the glory of the incorruptible God for an image...”</i></span></p>\n<p class=\"p1\"><span class=\"s1\">v24 - <i>“....God gave them over in the lusts of their hearts to impurity ...”</i></span></p>\n<p class=\"p1\"><span class=\"s1\">v25 - <i>“...they exchanged the truth of God for a lie, and worshiped and served the creature rather than the Creator,...”</i></span></p>\n<p class=\"p1\"><span class=\"s1\">v26 - <i>“...God gave them over to degrading passions;...”</i></span></p>\n<p class=\"p1\"><span class=\"s1\">v27 - <i>“...burned in their desire toward one another...”</i></span></p>\n<p class=\"p1\"><span class=\"s1\">v28 - <i>“...God gave them over to a depraved mind...”</i></span></p>\n<p class=\"p1\"><span class=\"s1\">v32 - <i>“...they not only do the same, but also give hearty approval to those who practice them.”</i></span></p>\n<p class=\"p2\">We also see the same link between idolatry and immorality in the book of Exodus. When Moses was on mount Sinai, the Israelites fashioned an idol of a golden calf for themselves, and called it their god and built it an altar. What happened next is tragic <i>“So the next day they rose early and offered burnt offerings, and brought peace offerings; and the people sat down to eat and to drink, and rose up to play”</i> - Ex 32:6. The phrase “rose up to play” is an euphemism of the sexual immorality that the Israelites had seen and practiced in Egypt. And this after they had witnessed the trumpets, thunder, fire, and quakings of the mountain of God. </p>\n<p class=\"p2\">When one sees this downward spiral at play, the seeming harmless sin of greed takes on a new importance. The Greek word for greed, pleonexia, is also translated as coveting. And coveting is expressly prohibited by the last among the ten commandments which in essence says, “Do not covet”.</p>\n<p class=\"p2\">Today’s world encourages the breaking of this commandment in its most extreme form. Tantalizing pictures of what we can purchase through EMI’s<span class=\"Apple-converted-space\">  </span>abound on every street corner, among the pages of every magazine and<span class=\"Apple-converted-space\">  </span>newspaper, and on every web site one visits. Cars, vacations, houses, gadgets, there just is no end to the articles sold in vanity fair. Coveting what we don’t have and what others have, stokes the flame of desire and before we know it, we are down the road of idolatry and over time given over to immorality. The god of Mammon, the god of money is the most common idol of our times, and we serve this idol thinking it can satisfy the unsatisfiable coveting of our lustful hearts. How merciful God is that He does give us over completely! </p>\n<p class=\"p2\">If we then see such clear and dangerous links, let us, as Paul exhorts in this verse, consider the members of our earthly body as dead to greed. How this translates into practical application could mean primarily keeping the mind free of coveting what God in his wisdom has chosen not to give us yet. Of keeping our hands from reaching out for even more money to buy even more things. Of choosing not to use our limited time and resources in the pursuit of the world’s goods at the cost of our physical and spiritual health and relationships.</p>\n<p class=\"p2\">Let's keep guard heeding the apostle John who wrote in 1 John 5:21: <i>“Little children, guard yourselves from idols.”</i></p>",
            "image": "https://opheleo.cf/media/posts/5/close-up-of-one-us-dollar-3635539.jpg",
            "author": {
                "name": "Iraxel"
            },
            "tags": [
                   "Articles"
            ],
            "date_published": "2020-04-19T19:09:50+05:30",
            "date_modified": "2020-04-23T19:26:56+05:30"
        },
        {
            "id": "https://opheleo.cf/about/",
            "url": "https://opheleo.cf/about/",
            "title": "About",
            "summary": "Opheleo is a Greek word which means to help, benefit, or do good. This online magazine with its collection of articles and essays attempts to live up to its name by being useful in the spiritual sense. Most of what is on this site is written from a Christian worldview, and the hope of the author who goes by the pen name Iraxel, is that it will assist people of all hues who stumble onto this site. Whether you are a believer or a seeker or a disinterested passerby, may you understand more clearly the purpose of the One who asked long&hellip;",
            "content_html": "<p>Opheleo is a Greek word which means to help, benefit, or do good. This online magazine with its collection of articles and essays attempts to live up to its name by being useful in the spiritual sense. Most of what is on this site is written from a Christian worldview, and the hope of the author who goes by the pen name Iraxel, is that it will assist people of all hues who stumble onto this site.</p>\n<p>Whether you are a believer or a seeker or a disinterested passerby, may you understand more clearly the purpose of the One who asked long ago: <em>What will it profit a man if he gains the world and forfeits his soul?</em></p>\n<p>You can reach out to Iraxel by using the contact form <a href=\"../../../../../contact\">here</a>. But be kind! Iraxel is just a pilgrim growing along the journey and sharing his thoughts, which sometimes may be wrong. He's always glad to accept all criticisms and corrections and requests only that they be proffered with grace. </p>",
            "author": {
                "name": "Iraxel"
            },
            "tags": [
            ],
            "date_published": "2020-04-19T16:55:45+05:30",
            "date_modified": "2020-04-19T21:15:57+05:30"
        }
    ]
}
